BaseConfiguration/Money_2_0/Catalogs/КартинкиПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КартинкиПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаBase64</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/КартинкиПриложения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик должен обслуживать только повторное чтение объекта (Обновить или Перечитать)
	Если ТегиКартинки.Количество() > 0 Тогда
		ОтметитьТеги(Неопределено);
		ПрочитатьКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьТаблицуТегов();
	АдресПустойКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Картинка, УникальныйИдентификатор);
	
	ТегиИзПараметров = Неопределено;
	Параметры.Свойство("Теги", ТегиИзПараметров);
	ОтметитьТеги(ТегиИзПараметров);
	ПрочитатьКартинку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() И АдресКартинки = АдресПустойКартинки Тогда
		ВыбратьФайлКартинки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КартинкаДляЗаписи = Неопределено;
	ОчиститьКартинку = (Не ЗначениеЗаполнено(АдресКартинки) Или АдресКартинки = АдресПустойКартинки);
	ДобавитьКартинкуИзФайла = ЗначениеЗаполнено(АдресКартинки) 
				И (Объект.Ссылка.Пустая() 
						Или АдресКартинки <> ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка"));
	Если ДобавитьКартинкуИзФайла Тогда
		КартинкаДляЗаписи = ПолучитьИзВременногоХранилища(АдресКартинки);
		Если ТипЗнч(КартинкаДляЗаписи) <> Тип("Картинка") Тогда
			ОчиститьКартинку = Истина;
			ДобавитьКартинкуИзФайла = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОчиститьКартинку Тогда
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(Неопределено);
		ТекущийОбъект.КартинкаBase64 = "";
	КонецЕсли;
	Если ДобавитьКартинкуИзФайла Тогда
		Справочники.КартинкиПриложения.ЗаписатьКартинкуВРеквизитыСправочника(ТекущийОбъект, КартинкаДляЗаписи);
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекущийОбъект.УстановитьНовыйКод(
					?(ПустаяСтрока(ТекущийОбъект.Код),"Картинка",ТекущийОбъект.Код));
		Если ПустаяСтрока(ТекущийОбъект.Наименование) Тогда
			ТекущийОбъект.Наименование = ТекущийОбъект.Код;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТегов = "";
	Для Каждого Элемент Из ТегиКартинки Цикл
		Если Элемент.Тег = "Раздел" 
			Или Элемент.Тег = "Сервис"
			Или Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТегов = СтрокаТегов + ?(СтрокаТегов = "", "", ";") + Элемент.Тег;
	КонецЦикла;
	Справочники.КартинкиПриложения.ЗаполнитьТеги(ТекущийОбъект, ТекущийОбъект.Код, СтрокаТегов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан элемент справочника", Объект.Ссылка);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьФайлКартинки();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТегиКартинки

&НаКлиенте
Процедура ТегиКартинкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТега = ТегиКартинки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаТега = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТега.Пометка = Не СтрокаТега.Пометка;
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	ВыбратьФайлКартинки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьТаблицуТегов()
	
	ТегиКартинки.Очистить();
	ВсеТеги = ОформлениеПриложенияКлиентСервер.СписокТеговДляКартинки(Объект.Системная);
	Для Каждого Элемент Из ВсеТеги Цикл
		СтрокаТега = ТегиКартинки.Добавить();
		СтрокаТега.Тег = Элемент;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКартинку()
	
	Если Объект.Ссылка.Пустая() Тогда
		АдресКартинки = СокрЛП(АдресПустойКартинки);
	Иначе
		СпрОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВремКартинка = СпрОбъект.Картинка.Получить();
		Если ТипЗнч(ВремКартинка) = Тип("Картинка") Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
		Иначе
			АдресКартинки = СокрЛП(АдресПустойКартинки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьТеги(ТегиИзПараметров)
	
	Для Каждого СтрокаТега Из ТегиКартинки Цикл
		СтрокаТега.Пометка = Ложь;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТегиИзПараметров) И Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТегов = ?(Объект.Ссылка.Пустая(), Строка(ТегиИзПараметров), Объект.Теги);
	СписокТегов = СтрРазделить(СтрокаТегов, ";", Ложь);
	Для Каждого СтрокаТега Из ТегиКартинки Цикл
		СтрокаТега.Пометка = СписокТегов.Найти(СтрокаТега.Тег) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлКартинки()
	
	ОбработчикВыбора = Новый ОписаниеОповещения("ВыборКартинкиЗавершение", ЭтотОбъект);
	ОформлениеПриложенияКлиент.ВыбратьФайлКартинки(ОбработчикВыбора, 50);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКартинкиЗавершение(ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	ВремКартинка = Новый Картинка(ВыбранныйФайл, Истина);
	АдресКартинки = ПоместитьВоВременноеХранилище(ВремКартинка, УникальныйИдентификатор);
	
	Если Объект.Ссылка.Пустая() Тогда
		Файл = ДеньгиРаботаСфайламиКлиентСервер.Файл(ВыбранныйФайл);
		Объект.Код = Сред(Файл.Расширение, 2);
		Объект.Наименование = Файл.ИмяБезРасширения;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры




#КонецОбласти
